Graph = {
    "Адмиралтейская": {
        "Садовая": 4},
    "Садовая": {
        "Сенная площадь": 4,
        "Спасская": 3,
        "Адмиралтейская": 4,
        "Звенигородская": 5},
    "Сенная площадь": {
        "Садовая": 4,
        "Спасская": 4},
    "Спасская": {
        "Садовая": 3,
        "Сенная площадь": 4,
        "Достоевская": 6},
    "Звенигородская": {
        "Пушкинская": 3,
        "Садовая": 5},
    "Пушкинская": {
        "Звенигородская": 3,
        "Владимирская": 4},
    "Владимирская": {
        "Достоевская": 3,
        "Пушкинская": 4},
    "Достоевская": {
        "Владимирская": 3,
        "Спасская": 6}
}

Distances = {k: 100 for k in Graph.keys()}  # расстояния
start_k = 'Адмиралтейская'  # стартовая вершина
Distances[start_k] = 0  # расстояние от неё до самой себя равно нулю
U = {k: False for k in Graph.keys()}  # флаги просмотра вершин
P = {k: None for k in Graph.keys()}  # для каждой вершины храним вершину предок, с минимальным расстоянием

for _ in range(len(Distances)):
    # выбираем среди непросмотренных наименьшее по расстоянию
    min_k = min([k for k in U.keys() if not U[k]], key=lambda x: Distances[x])

    for v in Graph[min_k].keys():  # проходимся по всем смежным вершинам
        if Distances[v] > Distances[min_k] + Graph[min_k][v]:
            Distances[v] = Distances[min_k] + Graph[min_k][v]
            #Distances[v] = min(Distances[v], Distances[min_k] + Graph[min_k][v])  # минимум (для немодифицированного
            #алг.Дейкстры, который не хранит для каждой вершины предка с наименьшим путем (в массиве P)
            P[v] = min_k  # запоминаем предка с минимальным расстоянием
    U[min_k] = True  # просмотренную вершину помечаем

pointer = "Владимирская" # куда должны прийти
path = [] # список с вершинами пути
print('P = ', P)
while pointer is not None: # перемещаемся, пока не придём в стартовую точку
   path.append(pointer)
   pointer = P[pointer]

path.reverse() # разворачиваем путь
for v in path:
    print(v)

#print(f'result {Distances}')
